In [1]:
## Make a list/Create dictionary
people = {
    "first": ['Abdul', 'Shah', 'Adnan'], 
    "last": ['Wasay', 'Khan', 'Khan'], 
    "email": ['abdulwasay@gmail.com', 'shahkhan@gmail.com', 'adnankhan@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first   last                 email
0  Abdul  Wasay  abdulwasay@gmail.com
1   Shah   Khan    shahkhan@gmail.com
2  Adnan   Khan   adnankhan@gmail.com

In [5]:
## display first and last name
df['first'] + ' ' + df['last']

0    Abdul Wasay
1      Shah Khan
2     Adnan Khan
dtype: object

In [6]:
## add the new column 'full_name'
## update the full name by using previous code
df['full_name'] = df['first'] + ' ' + df['last']

In [7]:
## display
df

   first   last                 email    full_name
0  Abdul  Wasay  abdulwasay@gmail.com  Abdul Wasay
1   Shah   Khan    shahkhan@gmail.com    Shah Khan
2  Adnan   Khan   adnankhan@gmail.com   Adnan Khan

In [8]:
## only want to display email and full_name column
## update the dictionary
## drop the first and last column
df.drop(columns=['first', 'last'], inplace=True)

In [9]:
df

                  email    full_name
0  abdulwasay@gmail.com  Abdul Wasay
1    shahkhan@gmail.com    Shah Khan
2   adnankhan@gmail.com   Adnan Khan

In [10]:
## split the full_name
df['full_name'].str.split(' ')

0    [Abdul, Wasay]
1      [Shah, Khan]
2     [Adnan, Khan]
Name: full_name, dtype: object

In [11]:
## split the full_name column to first and last column
df['full_name'].str.split(' ', expand=True)

       0      1
0  Abdul  Wasay
1   Shah   Khan
2  Adnan   Khan

In [12]:
## want to display full_name and splitted name
## [[]] use to access multiple columns
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [13]:
df

                  email    full_name  first   last
0  abdulwasay@gmail.com  Abdul Wasay  Abdul  Wasay
1    shahkhan@gmail.com    Shah Khan   Shah   Khan
2   adnankhan@gmail.com   Adnan Khan  Adnan   Khan

In [14]:
## add another name in list --> only adding first name
## append use for adding
## without ignore_index=True it gives error
df.append({'first': 'Shaukat'}, ignore_index=True)

                  email    full_name    first   last
0  abdulwasay@gmail.com  Abdul Wasay    Abdul  Wasay
1    shahkhan@gmail.com    Shah Khan     Shah   Khan
2   adnankhan@gmail.com   Adnan Khan    Adnan   Khan
3                   NaN          NaN  Shaukat    NaN

In [15]:
## make new Dictionary
## create new dataframe
people = {
    'first': ['Shaukat', 'Basharat'], 
    'last': ['Aziz', 'Ali'], 
    'email': ['shaukataziz@gmail.com', 'basharatali@gmail.com']
}

In [16]:
df2 = pd.DataFrame(people)

In [17]:
df2

      first  last                  email
0   Shaukat  Aziz  shaukataziz@gmail.com
1  Basharat   Ali  basharatali@gmail.com

In [18]:
## combine the 1st and 2nd dataframe
## ignore_index and without sortig
df.append(df2, ignore_index=True, sort=False)

                   email    full_name     first   last
0   abdulwasay@gmail.com  Abdul Wasay     Abdul  Wasay
1     shahkhan@gmail.com    Shah Khan      Shah   Khan
2    adnankhan@gmail.com   Adnan Khan     Adnan   Khan
3  shaukataziz@gmail.com          NaN   Shaukat   Aziz
4  basharatali@gmail.com          NaN  Basharat    Ali

In [19]:
## update all the info to our original dataframe
df = df.append(df2, ignore_index=True, sort=False)

In [20]:
df

                   email    full_name     first   last
0   abdulwasay@gmail.com  Abdul Wasay     Abdul  Wasay
1     shahkhan@gmail.com    Shah Khan      Shah   Khan
2    adnankhan@gmail.com   Adnan Khan     Adnan   Khan
3  shaukataziz@gmail.com          NaN   Shaukat   Aziz
4  basharatali@gmail.com          NaN  Basharat    Ali

In [21]:
## display only 4 rows
## drop index to 4
df.drop(index=4)

                   email    full_name    first   last
0   abdulwasay@gmail.com  Abdul Wasay    Abdul  Wasay
1     shahkhan@gmail.com    Shah Khan     Shah   Khan
2    adnankhan@gmail.com   Adnan Khan    Adnan   Khan
3  shaukataziz@gmail.com          NaN  Shaukat   Aziz

In [22]:
## filter
## drop all the rows having last name 'Khan'
filt = df['last'] == 'Khan'
df.drop(index=df[filt].index)

                   email    full_name     first   last
0   abdulwasay@gmail.com  Abdul Wasay     Abdul  Wasay
3  shaukataziz@gmail.com          NaN   Shaukat   Aziz
4  basharatali@gmail.com          NaN  Basharat    Ali

In [23]:
## we also do this without filt
## but with filt it is much easier and easy to read
df.drop(index=df[df['last'] == 'Khan'].index)

                   email    full_name     first   last
0   abdulwasay@gmail.com  Abdul Wasay     Abdul  Wasay
3  shaukataziz@gmail.com          NaN   Shaukat   Aziz
4  basharatali@gmail.com          NaN  Basharat    Ali